robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32f1/brdcfg/hal_brdcfg_ems001.c
/*
 * Copyright (C) 2011 Department of Robotics Brain and Cognitive Sciences - Istituto Italiano di Tecnologia
 * Author: Valentina Gaggero, Marco Accame
 * email:   valentina.gaggero@iit.it, marco.accame@iit.it
 * website: www.robotcub.org
 * Permission is granted to copy, distribute, and/or modify this program
 * under the terms of the GNU General Public License, version 2 or any
 * later version published by the Free Software Foundation.
 *
 * A copy of the license can be found at
 * http://www.robotcub.org/icub/license/gpl.txt
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
 * Public License for more details
*/

/* @file       hal_brdcfg_ems001.c
	@brief      This file implements low level functions which depend on board.
	@author     valentina.gaggero@iit.it
    @date       11/16/2010
**/

// - modules to be built: contains the HAL_USE_* macros ---------------------------------------------------------------
#include "hal_brdcfg_modules.h"

// --------------------------------------------------------------------------------------------------------------------
// - external dependencies
// --------------------------------------------------------------------------------------------------------------------

#include "stm32f1.h"
#include "cmsis_stm32f1.h"

#include "stdlib.h"
#include "hal_base.h"
#include "hal_stm32_base_hid.h"
#include "hal_stm32_spi4encoder_hid.h"
#include "hal_stm32_eth_hid.h"
#include "hal_stm32_eth_def.h"
#include "hal_eeprom.h"
#include "hal_timer.h"
#include "hal_i2c4hal.h"
#include "hal_watchdog.h"
#include "hal_switch.h"

// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern public interface
// --------------------------------------------------------------------------------------------------------------------

#include "hal_brdcfg_ems001.h"


// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern hidden interface 
// --------------------------------------------------------------------------------------------------------------------
// empty-section


// --------------------------------------------------------------------------------------------------------------------
// - #define with internal scope
// --------------------------------------------------------------------------------------------------------------------

#ifdef HAL_USE_I2C4HAL
    #define HAL_BRDCFG_I2C4HAL__I2C_CLK                          RCC_APB1Periph_I2C1
    #define HAL_BRDCFG_I2C4HAL__I2C_SCL_PIN                      GPIO_Pin_8 
    #define HAL_BRDCFG_I2C4HAL__I2C_SCL_GPIO_PORT                GPIOB
    #define HAL_BRDCFG_I2C4HAL__I2C_SCL_GPIO_CLK                 ( RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO) //Enable alternate function.     
    #define HAL_BRDCFG_I2C4HAL__I2C_SDA_PIN                      GPIO_Pin_9                  
    #define HAL_BRDCFG_I2C4HAL__I2C_SDA_GPIO_PORT                GPIOB                       
    #define HAL_BRDCFG_I2C4HAL__I2C_SDA_GPIO_CLK                 RCC_APB2Periph_GPIOB
#endif//HAL_USE_I2C4HAL


#ifdef HAL_USE_SPI4ENCODER
    //- SPI1 chip selecet
    #define HAL_BRDCFG_SPI4ENCODER__SPI1_GPIO_PORT_CS			 	GPIOD
//    #define HAL_BRDCFG_SPI4ENCODER__SPI1_GPIO_PORT_CS_CLOCK			RCC_APB2Periph_GPIOD
    #define SPI1_GPIO_SEL_ENCODER_PIN_1	  	GPIO_Pin_2
    #define SPI1_GPIO_SEL_ENCODER_PIN_2	  	GPIO_Pin_3
    #define SPI1_GPIO_ENA_SLAVE		  		GPIO_Pin_4
//    #define HAL_BRDCFG_SPI4ENCODER__SPI1_GPIO_ENA_ENCODER_0			GPIO_Pin_10
//    #define HAL_BRDCFG_SPI4ENCODER__SPI1_GPIO_ENA_ENCODER_1			GPIO_Pin_1
#define SPI1_GPIO_SEL_LOW_ENCODER_0  	SPI1_GPIO_SEL_ENCODER_PIN_1 | SPI1_GPIO_SEL_ENCODER_PIN_2
#define SPI1_GPIO_SEL_HIGH_ENCODER_0 	0
#define SPI1_GPIO_SEL_LOW_ENCODER_1    	SPI1_GPIO_SEL_ENCODER_PIN_2
#define SPI1_GPIO_SEL_HIGH_ENCODER_1  	SPI1_GPIO_SEL_ENCODER_PIN_1
#define SPI1_GPIO_SEL_LOW_ENCODER_2    	SPI1_GPIO_SEL_ENCODER_PIN_1
#define SPI1_GPIO_SEL_HIGH_ENCODER_2  	SPI1_GPIO_SEL_ENCODER_PIN_2
    //- SPI2 chip selecet
    #define HAL_BRDCFG_SPI4ENCODER__SPI2_GPIO_PORT_CS			 	GPIOD
//    #define HAL_BRDCFG_SPI4ENCODER__SPI2_GPIO_PORT_CS_CLOCK			RCC_APB2Periph_GPIOD
    #define SPI2_GPIO_SEL_ENCODER_PIN_1	  	GPIO_Pin_2
    #define SPI2_GPIO_SEL_ENCODER_PIN_2	  	GPIO_Pin_3
    #define SPI2_GPIO_ENA_SLAVE		  		GPIO_Pin_4 
//    #define HAL_BRDCFG_SPI4ENCODER__SPI2_GPIO_ENA_ENCODER_0			GPIO_Pin_10
//    #define HAL_BRDCFG_SPI4ENCODER__SPI2_GPIO_ENA_ENCODER_1			GPIO_Pin_1

#define SPI2_GPIO_SEL_LOW_ENCODER_0  	GPIO_Pin_2 | GPIO_Pin_3
#define SPI2_GPIO_SEL_HIGH_ENCODER_0 	0

#define SPI2_GPIO_SEL_LOW_ENCODER_1    	GPIO_Pin_3
#define SPI2_GPIO_SEL_HIGH_ENCODER_1  	GPIO_Pin_2

#define SPI2_GPIO_SEL_LOW_ENCODER_2    	GPIO_Pin_2
#define SPI2_GPIO_SEL_HIGH_ENCODER_2  	GPIO_Pin_3

#define SPI2_GPIO_ENA_ENCODER_ALL		GPIO_Pin_4
#define SPI2_GPIO_DESELECT_ENCODER_ALL	GPIO_Pin_2 | GPIO_Pin_3
   
    //- SPI3 chip selecet
    #define HAL_BRDCFG_SPI4ENCODER__SPI3_GPIO_PORT_CS			 	GPIOD
//    #define HAL_BRDCFG_SPI4ENCODER__SPI3_GPIO_PORT_CS_CLOCK			RCC_APB2Periph_GPIOD

    #define  SPI3_GPIO_SEL_ENCODER_PIN_1	  	GPIO_Pin_5
    #define  SPI3_GPIO_SEL_ENCODER_PIN_2	  	GPIO_Pin_6
    #define  SPI3_GPIO_ENA_SLAVE		  		GPIO_Pin_7
    
//    #define HAL_BRDCFG_SPI4ENCODER__SPI3_GPIO_ENA_ENCODER_0			GPIO_Pin_10
//    #define HAL_BRDCFG_SPI4ENCODER__SPI3_GPIO_ENA_ENCODER_1			GPIO_Pin_1

#define SPI3_GPIO_SEL_LOW_ENCODER_0  	SPI3_GPIO_SEL_ENCODER_PIN_1 | SPI3_GPIO_SEL_ENCODER_PIN_2
#define SPI3_GPIO_SEL_HIGH_ENCODER_0 	0

#define SPI3_GPIO_SEL_LOW_ENCODER_1    	SPI3_GPIO_SEL_ENCODER_PIN_2
#define SPI3_GPIO_SEL_HIGH_ENCODER_1  	SPI3_GPIO_SEL_ENCODER_PIN_1

#define SPI3_GPIO_SEL_LOW_ENCODER_2    	SPI3_GPIO_SEL_ENCODER_PIN_1
#define SPI3_GPIO_SEL_HIGH_ENCODER_2  	SPI3_GPIO_SEL_ENCODER_PIN_2

//    // SPI commnds for enable/disable chipselect
//    #define HAL_BRDCFG_SPI4ENCODER__SPI_CS_ENA(spix, e)	 	((hal_SPI4ENCODER_ENCDATA_GET(spix)).encoder_gpio_port->BRR |= hal_SPI4ENCODER_ENCDATA_CS_GET(spix, e).BRR_reg);
//    #define HAL_BRDCFG_SPI4ENCODER__SPI_CS_DISA(spix, e)	((hal_SPI4ENCODER_ENCDATA_GET(spix)).encoder_gpio_port->BSRR  |= hal_SPI4ENCODER_ENCDATA_CS_GET(spix, e).BSRR_reg);

