robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32f1/brdcfg/hal_brdcfg_ems001.c
// SPI commnds for enable/disable chipselect
						
#define HAL_BRDCFG_SPI4ENCODER__SPI_CS_ENA(spix)    (hal_SPI4ENCODER_ENCDATA_GET(spix)).encoder_gpio_port->BRR |=  ((hal_SPI4ENCODER_ENCDATA_GET(spix)).cs_pin_ena_slave);	//Livello basso del segnale
#define HAL_BRDCFG_SPI4ENCODER__SPI_CS_DISA(spix)   (hal_SPI4ENCODER_ENCDATA_GET(spix)).encoder_gpio_port->BSRR |=  ((hal_SPI4ENCODER_ENCDATA_GET(spix)).cs_pin_ena_slave);	//Livello alto


//SPI commands for select/deselct encoder "e"  connected on "spix"
#define HAL_BRDCFG_SPI4ENCODER__SPI_CS_SEL(spix, e)	 ((hal_SPI4ENCODER_ENCDATA_GET(spix)).encoder_gpio_port->BRR |= hal_SPI4ENCODER_ENCDATA_CS_GET(spix, e).BRR_reg);\
							 ((hal_SPI4ENCODER_ENCDATA_GET(spix)).encoder_gpio_port->BSRR |= hal_SPI4ENCODER_ENCDATA_CS_GET(spix, e).BSRR_reg);
#define HAL_BRDCFG_SPI4ENCODER__SPI_CS_DESEL(spix)	 ((hal_SPI4ENCODER_ENCDATA_GET(spix)).encoder_gpio_port->BSRR  |= hal_SPI4ENCODER_ENCDATA_CS_GET(spix, 0).BRR_reg);	//Livello alto

    
#endif//HAL_USE_SPI4ENCODER



#if defined(HAL_USE_ETH) || defined(HAL_USE_SWITCH)
    
    //#define HAL_BRDCFG_ETH__ETH_IS_IN_RESET_STATE(x)	    (x & 0x8800)
    #define HAL_BRDCFG_ETH_I2C_ADDRESS_WRITE_OP 0xBE        /* eth switch(micrel) device's address on I2C bus  for write operation */
    #define HAL_BRDCFG_ETH_I2C_ADDRESS_READ_OP  0xBF        /* eth switch(micrel) device's address on I2C bus  for read operation */
    // acemor on 16 sept 2011: the following are un-used ...
    #define HAL_BRDCFG_ETH__PHY_REG_ANER        0x06        /* Auto-Neg. Expansion Register      */
    #define HAL_BRDCFG_ETH__PHY_REG_ANNPTR      0x07        /* Auto-Neg. Next Page TX            */
    /* PHY Extended Registers */
    #define HAL_BRDCFG_ETH__PHY_REG_STS         0x10        /* Status Register                   */
    #define HAL_BRDCFG_ETH__PHY_REG_MICR        0x11        /* MII Interrupt Control Register    */
    #define HAL_BRDCFG_ETH__PHY_REG_MISR        0x12        /* MII Interrupt Status Register     */
    #define HAL_BRDCFG_ETH__PHY_REG_FCSCR       0x14        /* False Carrier Sense Counter       */
    #define HAL_BRDCFG_ETH__PHY_REG_RECR        0x15        /* Receive Error Counter             */
    #define HAL_BRDCFG_ETH__PHY_REG_PCSR        0x16        /* PCS Sublayer Config. and Status   */
    #define HAL_BRDCFG_ETH__PHY_REG_RBR         0x17        /* RMII and Bypass Register          */
    #define HAL_BRDCFG_ETH__PHY_REG_LEDCR       0x18        /* LED Direct Control Register       */
    #define HAL_BRDCFG_ETH__PHY_REG_PHYCR       0x19        /* PHY Control Register              */
    #define HAL_BRDCFG_ETH__PHY_REG_10BTSCR     0x1A        /* 10Base-T Status/Control Register  */
    #define HAL_BRDCFG_ETH__PHY_REG_CDCTRL1     0x1B        /* CD Test Control and BIST Extens.  */
    #define HAL_BRDCFG_ETH__PHY_REG_EDCR        0x1D        /* Energy Detect Control Register    */
    #define AL_BRDCFG_ETH__DP83848C_DEF_ADR    0x01        /* Default PHY device address        */
    #define AL_BRDCFG_ETH__DP83848C_ID         0x20005C90  /* PHY Identifier                    */
    //#define PHY_address 		DP83848C_DEF_ADR
    #define AL_BRDCFG_ETH__HAL_ETH_RESET_STATE_MASK		0x77FF//0x8800 DA SISTEMARE!!!!
// acemor on 16 sept 2011: the previous are un-used ...
#endif//HAL_USE_ETH

// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of extern variables, but better using _get(), _set() 
// --------------------------------------------------------------------------------------------------------------------

#ifdef HAL_USE_CAN
    extern const uint8_t hal_brdcfg_can__supported_mask             = 0x03;
#endif//HAL_USE_CAN

#ifdef HAL_USE_CRC
    extern const uint8_t hal_brdcfg_crc__supported_mask             = 0x01;
#endif//HAL_USE_CRC

#ifdef HAL_USE_DISPLAY
    extern const uint8_t hal_brdcfg_display__supported_mask         = 0x00;
#endif//HAL_USE_DISPLAY

#ifdef HAL_USE_ETH
    extern const uint8_t hal_brdcfg_eth__supported_mask             = 0x01;
    extern const uint16_t hal_brdcfg_eth__phy_device_list[HAL_BRDCFG_ETH__PHY_DEVICE_NUM] = {0x1, 0X2};
#endif//HAL_USE_ETH


#ifdef HAL_USE_EEPROM
    extern const uint8_t hal_brdcfg_eeprom__supported_mask         = (1 << hal_eeprom_emulatedflash) | (1 << hal_eeprom_i2c_01);
    extern const uint32_t hal_brdcfg_eeprom__emflash_baseaddress    = 0x08000000;
    extern const uint32_t hal_brdcfg_eeprom__emflash_totalsize      = 256*1024;
    extern const uint32_t hal_brdcfg_eeprom__i2c_01_baseaddress     = 0;
    extern const uint32_t hal_brdcfg_eeprom__i2c_01_totalsize       = 64*1024;
    
    extern const uint16_t hal_brdcfg_eeprom__i2c_01_address_i2c     = 0xA0; 
 
    //    // acemor-18nov11: the i2c address comes from here ...
    //    #define HAL_BRDCFG_EEPROM__sEE_M24C64_32
    //    #if defined (HAL_BRDCFG_EEPROM__sEE_M24C64_32)
    //      /*!< Select the EEPROM address according to the state of E0, E1, E2 pins */
    //      /* For M24C32 and M24C64 devices, E0,E1 and E2 pins are all used for device 
    //      address selection (ne need for additional address lines). According to the 
    //      Harwdare connection on the board (on STM3210C-EVAL board E0 = E1 = E2 = 0) */
    //     #define sEE_HW_ADDRESS     0xA0   /* E0 = E1 = E2 = 0 */ 
    //     //IIT note
    //     //The address of eeprom for emss001 and mcbstm32c is the same
    //      extern const uint16_t hal_brdcfg_i2c4hal__sEEAddress = 0xA0;  
    //    #else
    //        #error YOU MUST DEFINE A PROPER EEPROM
    //    #endif
    
#endif//HAL_USE_EEPROM     


#ifdef HAL_USE_I2C4HAL
    extern const uint8_t hal_brdcfg_i2c4hal__supported_mask = (1 << hal_i2c_port1);
#endif//HAL_USE_I2C4HAL


#ifdef HAL_USE_ENCODER
    extern const uint32_t hal_brdcfg_encoder__supported_mask = 0x01ff; // tutti e 9 gli encoder ...
#endif//HAL_USE_ENCODER

#ifdef HAL_USE_SPI4ENCODER
    extern const uint8_t hal_brdcfg_spi4encoder__supported_mask = 0x05;  // spi1 and spi3
#endif//HAL_USE_SPI4ENCODER

#ifdef HAL_USE_GPIO
    extern const uint16_t hal_brdcfg_gpio__supported_mask[hal_gpio_ports_number]    =
    {   // ok, i enable every pin of every port. however i should enable only those used a true gpio
        0xffff,     // port a
        0xffff,     // port b
        0xffff,     // port c
        0xffff,     // port d
        0xffff,     // port e
        0xffff,     // port f
        0xffff,     // port g
        0xffff,     // port h
        0xffff      // port i
    };
#endif//HAL_USE_GPIO

